Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_role.rds_enhanced_monitoring will be created
+ resource "aws_iam_role" "rds_enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rds-enhanced-monitoring-test"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ab0b79a11883:4141/lock?id=davidc-dev%252Fterraform-aws-dsif%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
<details><summary>Log</summary>
  <p>

```
[DBUG] Got workspace lock
[DBUG] 2 files were modified in this pull request
[DBUG] Clone directory "/home/atlantis/.atlantis/repos/davidc-dev/terraform-aws-dsif/1/default" already exists, checking if it's at the right commit
[DBUG] Repo is at correct commit "6d0d0ea93bbc6acf2adc2738433d6b85ecb29470" so will not re-clone
[INFO] Found no atlantis.yaml file
[INFO] Filtered modified files to 2 .tf or terragrunt.hcl files: [main.tf variables.tf]
[INFO] There are 1 modified project(s) at path(s): .
[INFO] Automatically determined that there were 1 projects modified in this pull request: [repofullname=davidc-dev/terraform-aws-dsif path=.]
[DBUG] Determining config for project at dir: "."
[DBUG] Building config based on server-side config
[DBUG] Setting workflow: "default" from default server config
[DBUG] Setting allowed_overrides: [] from default server config
[DBUG] Setting allow_custom_workflows: false from default server config
[DBUG] Setting apply_requirements: [] from default server config
[INFO] Cannot determine which version to use from terraform configuration, detected 0 possibilities.
[INFO] Acquired lock with id "davidc-dev/terraform-aws-dsif/./default"
[DBUG] Acquired lock for project
[DBUG] Clone directory "/home/atlantis/.atlantis/repos/davidc-dev/terraform-aws-dsif/1/default" already exists, checking if it's at the right commit
[DBUG] Repo is at correct commit "6d0d0ea93bbc6acf2adc2738433d6b85ecb29470" so will not re-clone
[INFO] Successfully ran "/usr/local/bin/terraform init -input=false -no-color -upgrade" in "/home/atlantis/.atlantis/repos/davidc-dev/terraform-aws-dsif/1/default"
[INFO] Successfully ran "/usr/local/bin/terraform workspace show" in "/home/atlantis/.atlantis/repos/davidc-dev/terraform-aws-dsif/1/default"
[INFO] Successfully ran "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/davidc-dev/terraform-aws-dsif/1/default/default.tfplan\"" in "/home/atlantis/.atlantis/repos/davidc-dev/terraform-aws-dsif/1/default"
```
</p></details>
